<h1>Задание от BWT</h1>
<ul>
  <li>Cоздать аккаунт на github.com (если его нет )</li>
  <li>создать проект bwt_test</li>
  <li>все изменения в коде вести через git.</li>
  <li>создать 4 страницы с одной точкой входа.</li>
  <li>при создании страниц использовать Model-view-controller(собственная реализация, без фреймворков).</li>
  <li><strong>страница 1</strong> - форма регистрации. Поля: имя, фамилия, email, пол, день рождения (пол и день рождения - необязательные поля. валидация должна быть и на стороне клиента, и на стороне сервера)</li>
  <li><strong>страница 2</strong> - отображать погоду на сегодня в городе Запорожье (только зарегистрированные пользователи имеют доступ). Данные парсить по этойссылке http://www.gismeteo.ua/city/daily/5093/</li>
  <li><strong>страница 3</strong> - форма обратной связи. поля: имя, email, сообщение (все поля обязательные, валидация должна быть и на стороне клиента, и на сторонесервера). Также добавить капчу.</li>
  <li><strong>страница 4</strong> - отображать список фидбеков, оставленных на странице 3.(только зарегистрированные пользователи имеют доступ)</li>
  <li>для верстки использовать плагин bootstrap 3.</li>
  <li>для парсинга погоды можно использовать пакет guzzle ( https://github.com/guzzle/guzzle )</li>
  <li>создать ER-диаграму структуры созданной базы данных. Так же положить ее в git.</li>
  <li>прислать нам ссылку на github проект.</li>
</ul>